#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2020/1/4 10:22
# @Author  : sakura
# @Site    : “stack”
# @File    : __init__.py.py
# @Software: PyCharm

"""数据结构中的  ‘栈’
特征： 后进先出   先进后出  —— 是一种’操作受限’ 的线性表
        从功能上来说 数组和链表确实可以题代栈，但是特定的数据结构是对特定场景的抽象，而且数组或者链表暴露了太多的操作接口
        操作上确实灵活自由，但是使用时比较不可控，自然就更容易出错

适用场景： 当某个数据集合只涉及在一段插入和删除数据，并且满足后进先出、先进后出的特性，我们就应该选择‘栈’这种数据结构
实现方式： 操作包括  入栈和出栈
           用数组实现：  顺序栈
           用链表实现：  链式栈

"""




'''
1. 浏览器的进退功能


2. 支持动态扩容的顺序栈——用数组实现，空间复杂度和时间复杂度是多少？


3. 栈在函数调用中，使用的数据结构？ 为什么？


4.栈在表达式求值中的应用


5. 栈在括号匹配中的应用
'''